{"id":"INC-028","title":"Azure Application Gateway 502 errors - backend health probe failure","summary":"Azure Application Gateway appgw-prod-01 returned HTTP 502 Bad Gateway for all requests to the backend pool hosting the customer-portal service. The backend health dashboard showed all 4 backend instances as Unhealthy. The application was running correctly and responding to direct requests on port 8080. Investigation revealed the health probe was configured to send HTTP GET requests to path /health on port 443 with HTTPS protocol, but the backend pods served HTTP on port 8080. The probe path /health returned a 301 redirect to /health/ which Application Gateway treated as an unhealthy response.","source":"azure-docs","root_cause":"Application Gateway health probe was misconfigured with three issues: (1) probe protocol was HTTPS but backend pods only served HTTP on port 8080, (2) the probe port was set to 443 instead of 8080, (3) the application's /health endpoint returned a 301 redirect to /health/ (with trailing slash) and Application Gateway custom probes do not follow redirects. The probe expected a 200 response code range but received connection failures and 301s, marking all backends unhealthy.","resolution":"Reconfigured Application Gateway health probe: changed protocol to HTTP, port to 8080, path to /health/ (with trailing slash to avoid redirect). Set match status codes to 200-399. Updated backend HTTP settings to use port 8080 with HTTP protocol. Enabled connection draining with 30-second timeout. Added the probe-host-name-from-backend-http-settings override. All backend instances returned to healthy status within 2 probe intervals (20 seconds). Configured Azure Monitor alert for backend health percentage dropping below 75%.","services":["application-gateway","customer-portal","backend-pool","azure-monitor"],"service":"application-gateway","severity":"P1","timestamp":"2026-02-01T16:05:00Z","tags":["azure","application-gateway","502","health-probe","backend","load-balancer"]}