{"id":"INC-029","title":"OOMKilled in Kubernetes despite resource limits - JVM heap overflow","summary":"Java-based order-processing service pods were repeatedly OOMKilled despite having resource limits set to 2Gi memory. The JVM was started with -Xmx1536m (1.5GB heap) which appeared to leave 512MB headroom for non-heap memory. However, the container was killed with OOMKilled exit code 137, and dmesg showed the cgroup memory limit being exceeded. The JVM's total memory usage including metaspace (350MB), thread stacks (200 threads x 1MB each), direct byte buffers (256MB for Netty), and code cache (128MB) far exceeded the 2Gi container limit. The issue affected 5 out of 8 replicas during peak traffic, causing cascading failures in the order pipeline.","source":"stackoverflow","root_cause":"JVM total memory consumption exceeded the container cgroup memory limit of 2Gi. While -Xmx was set to 1536m, the JVM's actual memory footprint included: heap 1536MB + metaspace 350MB + thread stacks 200MB (200 threads x 1MB) + direct buffers 256MB (Netty allocations) + code cache 128MB + JVM overhead ~100MB = approximately 2570MB total. The container memory limit of 2Gi (2048MB) was insufficient. The JVM flag -XX:+UseContainerSupport was enabled but only affects ergonomic heap sizing when -Xmx is not explicitly set.","resolution":"Reduced -Xmx to 1024m and set -XX:MaxMetaspaceSize=256m, -XX:ReservedCodeCacheSize=64m, -XX:MaxDirectMemorySize=128m, -Xss512k. Added -XX:NativeMemoryTracking=summary for ongoing monitoring. Increased container memory limit to 2.5Gi to provide adequate headroom. Added a JMX exporter sidecar to expose JVM memory metrics to Prometheus. Set memory requests equal to limits to guarantee QoS class Guaranteed. OOMKilled incidents dropped to zero over the following 2 weeks.","services":["order-processing","jvm-runtime","netty-server","prometheus-monitoring"],"service":"order-processing","severity":"P2","timestamp":"2026-02-03T09:40:00Z","tags":["kubernetes","oomkilled","jvm","heap","cgroup","memory","java","netty"]}