{"id":"INC-030","title":"Helm upgrade fails with another operation in progress","summary":"Helm upgrade --install for the api-gateway chart failed with error 'Error: UPGRADE FAILED: another operation (install/upgrade/rollback) is in progress'. No other Helm operations were running. The Helm release secret in the cluster showed the last release revision in status 'pending-upgrade' from a previous failed deployment 3 days prior. The CI/CD pipeline (ArgoCD) retried the upgrade 5 times with the same error. Manual helm rollback also failed with the same message. The api-gateway service was running on the previously successful revision but could not be updated with critical security patches for 6 hours until resolved.","source":"github-issues","root_cause":"A previous Helm upgrade was interrupted when the CI/CD runner pod was evicted mid-operation, leaving the Helm release in a 'pending-upgrade' state. Helm stores release state as Kubernetes secrets (labeled with owner=helm) in the release namespace. The stale secret for revision 47 had status 'pending-upgrade' which blocked all subsequent Helm operations. Helm v3 does not automatically recover from interrupted operations and requires manual intervention to clear the stale state.","resolution":"Identified the stale release secret with kubectl get secrets -l owner=helm,name=api-gateway -n production. Patched the stale secret status from 'pending-upgrade' to 'failed' using kubectl edit or: kubectl patch secret sh.helm.release.v1.api-gateway.v47 -n production -p '{\"data\":{}}' followed by helm history cleanup. Alternatively used helm rollback api-gateway 46 after marking revision 47 as failed. Added a pre-upgrade CI/CD pipeline step that checks for pending Helm release states and auto-remediates. Configured Helm timeout of 600s and --atomic flag to auto-rollback on failure.","services":["api-gateway","helm-releases","argocd","ci-cd-pipeline"],"service":"api-gateway","severity":"P2","timestamp":"2026-02-05T22:15:00Z","tags":["helm","kubernetes","release","upgrade","stale-secret","argocd","ci-cd"]}